Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    # 1. Warm up phase (5 virtual users per second)
    - duration: 30
      arrivalRate: 5
      name: Warm-up
    # 2. Ramp up phase (scaling from 5 to 100 users over 60s)
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: Ramp-up
    # 3. Baseline Load phase (100 users per second running continuously for 1 min)
    - duration: 60
      arrivalRate: 100
      name: Baseline
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Fetch Public Dashboard"
    flow:
      - get:
          url: "/community-stats"
      - think: 1
      - get:
          url: "/food-listings"
